# RBS Salary Fum Rank

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salary_edited_to_fit_18-19')

In [3]:
rbs = pd.read_csv('../Capstone_csv_file/rbs_fum_rank_18-19')

In [4]:
rbs

                   NAME  FUM  FUM_rank
0            Nick Chubb    0      16.0
1          LeSean McCoy    0      16.0
2     Leonard Fournette    0      16.0
3           Alfred Blue    0      16.0
4       Jamaal Williams    0      16.0
..                  ...  ...       ...
91  Christian McCaffrey    4      93.0
92         James Conner    4      93.0
93        Corey Clement    4      93.0
94      Ezekiel Elliott    6      95.0
95          Tarik Cohen    7      96.0

[96 rows x 3 columns]

In [5]:
rbs.set_index('NAME', inplace = True)

In [6]:
rbs_final_salary = rbs.merge(salary, on = 'NAME')

In [7]:
rbs_final_salary.set_index('NAME', inplace = True)

In [8]:
rbs_final_salary.head()

                   FUM  FUM_rank   salary
NAME
Nick Chubb           0      16.0  1845774
LeSean McCoy         0      16.0  8000000
Leonard Fournette    0      16.0  6787711
Marshawn Lynch       0      16.0  4500000
Isaiah Crowell       0      16.0  4000000

In [9]:
rbs_final_salary.to_csv('../Capstone_csv_file/rbs_fum_salary_18-19')